docs/02-Arquitectura-y-UML.md
```mermaid
classDiagram
    class Vuelo {
        +int Id
        +string NumeroVuelo
        +DateTime HorarioProgramado
        +string Puerta
        +NivelVisibilidad NivelVisibilidad
        +AplicarCambioDeHorario()
        +AplicarCambioDePuerta()
        +AplicarCambioDeEstado()
    }
    class EstadoVuelo {
        +int Id
        +string Nombre
        +bool EsFinal()
        +SecuenciaOperativa
    }
    class CambioOperativo {
        +int Id
        +TipoCambioOperativo TipoCambio
        +string Causa
        +string ValorAnterior
        +string ValorNuevo
    }
    class Seguimiento {
        +int Id
        +int VueloId
        +string Usuario
    }
    class Notificacion {
        +int Id
        +int VueloId
        +int CambioOperativoId
        +string Usuario
        +bool Leida
    }
    class Auditoria {
        +int Id
        +string Accion
        +string Tabla
        +string Descripcion
        +string ValorAnterior
        +string ValorNuevo
    }
    Vuelo --> EstadoVuelo : estado actual
    Vuelo "1" --> "0..*" CambioOperativo : registra
    Vuelo "1" --> "0..*" Seguimiento : es seguido
    CambioOperativo "1" --> "0..*" Notificacion : origina
    Vuelo "1" --> "0..*" Notificacion : recibe cambios
    CambioOperativo --> Auditoria : audita
```
